# -**- mode: org; coding: utf-8 -**-
#+TITLE: HAP - Generic Document Skeleton
#+EXPORT_FILE_NAME: HAP_Generic-Document-Skeleton.pdf
#+TEXT: Copyright © 2022 Harmonic Alchemy Productions & Others
#+AUTHOR: Alisha Awen - Harmonic Alchemy Productions
#+EMAIL: Siren1@disroot.org
#+DATE: <2021-05-22 Sat>
#+TEXT: Created: <2021-05-21 Fri>
#+TEXT: Last Published: <Not Published>
#+FILETAGS: templates docs unpublished

#+DESCRIPTION: HAP - Generic Document Skeleton with basic structure for smaller documents that don't require so much planning etc. Great for simple outlines, one page docs, short How-Tos, etc., (easily modified to make reports, charts, etc.)  Publishable as a Simple PDF...

#+BEGIN_COMMENT 
=Setup Files:=

   For Cloned Versions of this template, the file/paths below will be relative
   to your parent project directory and as such, should be all set to your new: ~.../your-fiction-book-project/org-templates/~ directory...

=NOTE:= 

   ~#+CATEGORY:~ is specified within ~gen-doc.org~ SETUPFILE.
   If you need to change the category, do it in your cloned version
   of gen-doc.org...

   *SETUPFILE:* ~default-tags.org~ is where tags are set for this project...

   *SETUPFILE:* ~latex-simple-pdf.org~ is for LaTeX Export Configurations 
              to produce a Simple PDF version of your Document...
#+END_COMMENT

#+SETUPFILE: ./org-templates/gen-doc.org
#+SETUPFILE: ./org-templates/latex-simple-pdf.org
#+SETUPFILE: ./org-templates/default-tags.org

:READ_ME_FIRST:
☞ =Instructions:= /(How to Install & Use This Template)/

To use *HAP_Generic-Document-Skeleton.org* /(Org-Mode Generic Doc Project /Template)/ for your own projects, perform the following steps: 

/Use the org-mode Checkboxes to Help You Keep Track of Progress/

1) [ ] *Clone a Copy of This File:*

      Put your clone where you normally organize your writing 
      projects. *Place it within its own master folder... It is*
      *Important to keep this file within its OWN enclosing folder!* 

*** NEW 📄 Heading S /(template with src-code blocks, etc. - rename this)/

- *SysAdmin & Command Prompts:*

   #+begin_src conf
   admin@vps1:~$ sudo apt update
   #+end_src

   #+begin_src conf
   user@home:~$ git status
   #+end_src

- *Evaluate some eLisp code:*

   #+begin_src emacs-lisp
   (defvar test1 "test1 value")
   (defvar test2 "test2 value")
   test2
   #+end_src

   #+results:
   : test2 value

   #+begin_src emacs-lisp
   (defvar test1 "test1 value")
   (defvar test2 "test2 value")
   test1
   #+end_src

   #+results:
   : test1 value

\newpage

